#Область ПрограммныйИнтерфейс

Функция НеУстаревшаяФункция() Экспорт
	Возврат 1;
КонецФункции

Процедура ВерсионированиеПриЗаписи(Источник, Отказ) Экспорт
	Отказ = Ложь;
КонецПроцедуры

#КонецОбласти

Процедура НеУстаревшаяПроцедура() Экспорт
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура РегистрацияИзмененийПередУдалением(Источник, Отказ)
	Отказ = Ложь;
КонецПроцедуры

Процедура Тест()
	Результат = НеУстаревшаяФункция();
	Результат = ПервыйОбщийМодуль.НеУстаревшаяФункция();
КонецПроцедуры

#КонецОбласти
